app/Views/partials/Header.php

if (!empty($session->get('user_id'))) {
    try {
        $db = db_connect();
        $balanceRow = $db->table('UserSolde')
            ->select('Solde')
            ->where('UserId', (int) $session->get('user_id'))
            ->get()
            ->getRowArray();
---
SELECT `Solde`
FROM `UserSolde`
WHERE `UserId` = 2