app/Controllers/Auth.php

    public function adminDashboard()
    {
        $session = service('session');
        $userId = $session->get('user_id');

        if (empty($userId)) {
            return redirect()->to('/admin');
        }

        try {
            $db = db_connect();
            $user = $db->table('USER')
                ->select('UserTypeId')
                ->where('Id', (int) $userId)
                ->get()
                ->getRowArray();
---
SELECT `UserTypeId`
FROM `USER`
WHERE `Id` = 4