app/Controllers/Dashboard.php

SELECT *
FROM `UserInfo`
WHERE `UserId` = 3
SELECT *
FROM `Evolution`
WHERE `UserId` = 3
ORDER BY `DateEvolution` DESC, `Id` DESC
---
  public function index()
{
    $session = service('session');
    $userId = $session->get('user_id');

    if (empty($userId)) {
        return redirect()->to('/SignIn');
    }

    $db = \Config\Database::connect();


$userInfo = $db->table('UserInfo')->where('UserId', $userId)->get()->getRowArray();
$tailleBase = ($userInfo && $userInfo['Taille'] > 0) ? (float)$userInfo['Taille'] : 1.70;
$tailleM = ($tailleBase > 3) ? $tailleBase / 100 : $tailleBase;

$dernierSuivi = $db->table('Evolution')
                   ->where('UserId', $userId)
                   ->orderBy('DateEvolution', 'DESC')
                   ->orderBy('Id', 'DESC')
                   ->get()->getRowArray();

INSERT INTO `Evolution` (`UserId`, `Poids`, `DateEvolution`) VALUES (4, '12', '2026-05-09')
---
   public function ajouterPoids()
{
    $session = service('session');
    $userId = $session->get('user_id');

    if (empty($userId)) {
        return redirect()->to('/SignIn');
    }

    $poids = $this->request->getPost('poids');

    if ($poids > 0) {
        $evolutionModel = new EvolutionModel();
        $evolutionModel->insert([
            'UserId'         => $userId,
            'Poids'          => $poids,
            'DateEvolution'  => date('Y-m-d')
        ]);