app/Controllers/Dashboard.php

    public function ajouterPoids()
    {
        $evolutionModel = new EvolutionModel();
        $evolutionModel->insert([
            'UserId'         => $this->request->getPost('userId'),
            'Poids'          => $this->request->getPost('poids'),
            'DateEvolution'  => date('Y-m-d')
        ]);
---
INSERT INTO `Evolution` (`UserId`, `Poids`, `DateEvolution`) VALUES (3, '13', '2026-05-09')