app/Models/ClientModel.php

        public function getClientsWithCurrentRegime(?string $search = null, int $limit = 20, int $offset = 0): array
        {
            $builder = $this->db->table('USER u');
            $builder->select('u.Id, u.Nom, u.Prenom, u.Email, u.UserTypeId, ut.UserType, gt.Genre, ui.Age, ui.Taille, ui.Poids, ru.DateDebut, ru.DureeEnJours, r.RegimeNom')
                ->join('UserType ut', 'ut.Id = u.UserTypeId', 'left')
                ->join('Genre gt', 'gt.Id = u.GenreId', 'left')
                ->join('UserInfo ui', 'ui.UserId = u.Id', 'left')
                ->join(
                    '(SELECT ru1.* FROM RegimeUser ru1 INNER JOIN (SELECT UserId, MAX(DateDebut) AS MaxDateDebut FROM RegimeUser GROUP BY UserId) latest ON latest.UserId = ru1.UserId AND latest.MaxDateDebut = ru1.DateDebut) ru',
                    'ru.UserId = u.Id',
                    'left',
                    false
                )
                ->join('REGIME r', 'r.Id = ru.RegimeId', 'left');

            if ($search !== null && trim($search) !== '') {
                $builder->groupStart()
                    ->like('u.Nom', $search)
                    ->orLike('u.Prenom', $search)
                    ->orLike('u.Email', $search)
                    ->groupEnd();
            }

            $builder->orderBy('u.Id', 'DESC')
                ->limit($limit, $offset);

            return $builder->get()->getResultArray();
---
SELECT `u`.`Id`, `u`.`Nom`, `u`.`Prenom`, `u`.`Email`, `u`.`UserTypeId`, `ut`.`UserType`, `gt`.`Genre`, `ui`.`Age`, `ui`.`Taille`, `ui`.`Poids`, `ru`.`DateDebut`, `ru`.`DureeEnJours`, `r`.`RegimeNom`
FROM `USER` `u`
LEFT JOIN `UserType` `ut` ON `ut`.`Id` = `u`.`UserTypeId`
LEFT JOIN `Genre` `gt` ON `gt`.`Id` = `u`.`GenreId`
LEFT JOIN `UserInfo` `ui` ON `ui`.`UserId` = `u`.`Id`
LEFT JOIN (SELECT ru1.* FROM RegimeUser ru1 INNER JOIN (SELECT UserId, MAX(DateDebut) AS MaxDateDebut FROM RegimeUser GROUP BY UserId) latest ON latest.UserId = ru1.UserId AND latest.MaxDateDebut = ru1.DateDebut) ru ON ru.UserId = u.Id
LEFT JOIN `REGIME` `r` ON `r`.`Id` = `ru`.`RegimeId`
WHERE   (
`u`.`Nom` LIKE '%User1%' ESCAPE '!'
OR  `u`.`Prenom` LIKE '%User1%' ESCAPE '!'
OR  `u`.`Email` LIKE '%User1%' ESCAPE '!'
 )
ORDER BY `u`.`Id` DESC
 LIMIT 12

        public function countClients(?string $search = null): int
        {
            $builder = $this->db->table('USER u');

            if ($search !== null && trim($search) !== '') {
                $builder->groupStart()
                    ->like('u.Nom', $search)
                    ->orLike('u.Prenom', $search)
                    ->orLike('u.Email', $search)
                    ->groupEnd();
            }

            return (int) $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `USER` `u`
WHERE   (
`u`.`Nom` LIKE '%User1%' ESCAPE '!'
OR  `u`.`Prenom` LIKE '%User1%' ESCAPE '!'
OR  `u`.`Email` LIKE '%User1%' ESCAPE '!'
 )