app/Models/CodeModel.php

SELECT *
FROM `Code`
ORDER BY `Id` ASC
---
        public function getCodes()
        {
            return $this->orderBy('Id', 'ASC')->findAll();

SELECT *
FROM `Code`
WHERE `Code`.`Id` = '16'
---
        public function getCodeById($id)
        {
            return $this->find($id);

INSERT INTO `Code` (`Code`, `Valeur`) VALUES ('CODE 12', '100')
---
        public function createCode($code, $valeur, $dateExpiration = null, $actif = 1) {
            $data = $this->filterPayload([
                'Code' => $code,
                'Valeur' => $valeur,
                'DateExpiration' => $dateExpiration,
                'Actif' => $actif
            ]);
            return $this->insert($data);