app/Models/EvolutionModel.php

SELECT *
FROM `Evolution`
WHERE `UserId` = 3
ORDER BY `DateEvolution` ASC
---
    public function getEvolutionByUser($userId)
    {
        return $this->where('UserId', $userId)
                    ->orderBy('DateEvolution', 'ASC')
                    ->findAll();