app/Models/RegimeModel.php

SELECT `REGIME`.*, `CompoRegime`.`Viande`, `CompoRegime`.`Poisson`, `CompoRegime`.`Volailles`, `TypeDeRegime`.`TypeDeRegime` AS `TypeNom`
FROM `REGIME`
LEFT JOIN `CompoRegime` ON `CompoRegime`.`RegimeId` = `REGIME`.`Id`
LEFT JOIN `TypeDeRegime` ON `TypeDeRegime`.`Id` = `REGIME`.`TypeDeRegimeId`
---
    public function getRegimesWithDetails()
    {
        return $this->select('REGIME.*, CompoRegime.Viande, CompoRegime.Poisson, CompoRegime.Volailles, TypeDeRegime.TypeDeRegime AS TypeNom')
                    ->join('CompoRegime', 'CompoRegime.RegimeId = REGIME.Id', 'left')
                    ->join('TypeDeRegime', 'TypeDeRegime.Id = REGIME.TypeDeRegimeId', 'left')
                    ->findAll();

SELECT `r`.*, `c`.`Viande`, `c`.`Poisson`, `c`.`Volailles`
FROM `REGIME` `r`
LEFT JOIN `CompoRegime` `c` ON `r`.`Id` = `c`.`RegimeId`
WHERE `r`.`TypeDeRegimeId` = 1
---
    public function getRegimeWithDetails($id)
    {
        return $this->select('REGIME.*, CompoRegime.Viande, CompoRegime.Poisson, CompoRegime.Volailles, TypeDeRegime.TypeDeRegime AS TypeNom')
                    ->join('CompoRegime', 'CompoRegime.RegimeId = REGIME.Id', 'left')
                    ->join('TypeDeRegime', 'TypeDeRegime.Id = REGIME.TypeDeRegimeId', 'left')
                    ->where('REGIME.Id', $id)
                    ->first();

SELECT `Id`, `TypeDeRegime`
FROM `TypeDeRegime`
---
    public function getTypeDeRegimeOptions()
    {
        return $this->db->table('TypeDeRegime')
            ->select('Id, TypeDeRegime')
            ->get()
            ->getResultArray();