app/Models/SportModel.php

SELECT `SPORT`.*, `TypeDeSport`.`TypeDeSport` as `Categorie`
FROM `SPORT`
LEFT JOIN `TypeDeSport` ON `TypeDeSport`.`Id` = `SPORT`.`TypeDeSportId`
---
    public function getSportsWithTypes()
{
    return $this->db->table('SPORT s')
        ->select('s.*, t.TypeDeSport as Categorie')
        ->join('TypeDeSport t', 't.Id = s.TypeDeSportId')
        ->get()
        ->getResultArray();